---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotPlaceRebarWarn
source: html/1cf781e1-b05f-cdb8-b0f5-3427fdb2175f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.CannotPlaceRebarWarn Property

Can't find a host for Rebar.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPlaceRebarWarn { get; }
```